n5/src/Catalogs/CustomsGroups/CustomsGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CustomsGroups</name>
  <tabularSections>
    <name>Charges</name>
    <attributes>
      <name>Charge</name>
      <type>
        <types>CatalogRef.CustomsCharges</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/CustomsGroups/Forms/Form/Module.bsl
&AtClient
var ChargesRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	StandardButtons.Arrange ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure ChargesOnActivateRow ( Item )
	
	ChargesRow = Item.CurrentData;
	setPercent ();
	
EndProcedure

&AtClient
Procedure setPercent () 

	if ( ChargesRow = undefined ) then
		return;
	endif;
	flag = DF.Pick ( ChargesRow.Charge, "Type" ) = PredefinedValue ( "Enum.CustomsCharges.VAT" );
	Items.Charges.ChildItems.ChargesPercent.ReadOnly = flag;

EndProcedure

&AtClient
Procedure ChargesChargeOnChange ( Item )
	
	applyCharge ();
	setPercent ();
	
EndProcedure

&AtClient
Procedure applyCharge () 

	ChargesRow.Percent = DF.Pick ( ChargesRow.Charge, "Percent" );

EndProcedure
